

def book_list_view(library):
    if not library:
        print("В библиотеке нет книг")
    else:
        print(library.keys())




library = {
    "Мастер и Маргарита": {
           "автор": "Михаил Булгаков",
           "год издания": 1967,
            "наличие": True
    },
    "Гарри Поттер": {
        "автор": "Дж. Роулинг",
        "год издания": 2011,
        "наличие": False
    },
    "Алхимик": {
        "автор": "П. Коэльо",
        "год издания": 1999,
        "наличие": True
    },
    "Бетмен": {
        "автор": "Marvel",
        "год издания": 2007,
        "наличие": True
    },
}

none_library = {}
book_list_view(library)
